app/views/halls/index.html.erb

SELECT "halls".* FROM "halls"
---
	<div class="container">
		<% Hall.all.each do |hall| %>