app/views/halls/show.html.erb

SELECT "foods".* FROM "foods"
---
	<div class="container">
		<% Food.all.each do |food| %>

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."food_id" = ?  [["food_id", 1]]
---
		    <div class="comment-count">
		    	<span class="tag is-rounded"><%= food.reviews.count %> comments</span>

SELECT "amenities".* FROM "amenities"
---
	<div class="container">
		<% Amenity.all.each do |amenity| %>

SELECT COUNT(*) FROM "statuses" WHERE "statuses"."amenity_id" = ?  [["amenity_id", 1]]
---
		    <div class="comment-count">
		    	<span class="tag is-rounded"><%= amenity.statuses.count %> statuses</span>