app/views/halls/show.html.erb

<h2>Menu</h2>
<% @hall.foods.each do |food| %>
---
SELECT "foods".* FROM "foods"