app/views/amenities/show.html.erb

SELECT "statuses".* FROM "statuses" WHERE "statuses"."amenity_id" = ?  [["amenity_id", 2]]
---
	<div class="container">
		<% @amenity.statuses.each do |status|%>