app/views/foods/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."food_id" = ?  [["food_id", 1]]
---
	<div class="container">
		<% @food.reviews.each do |review|%>