app/controllers/amenities_controller.rb

  def create
    @amenity = Amenity.new(amenity_params)

    respond_to do |format|
      if @amenity.save
---
INSERT INTO "amenities" ("name", "hall_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Chocolate Milk"], ["hall_name", "Luetner"], ["created_at", "2018-12-14 23:53:15.846794"], ["updated_at", "2018-12-14 23:53:15.846794"]]

    def set_amenity
      @amenity = Amenity.find(params[:id])
---
SELECT  "amenities".* FROM "amenities" WHERE "amenities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]