app/controllers/foods_controller.rb

  def create
    @food = Food.new(food_params)

    respond_to do |format|
      if @food.save
---
INSERT INTO "foods" ("name", "hall_name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Carrots"], ["hall_name", "Luetner"], ["description", "orange"], ["created_at", "2018-12-10 14:33:20.399311"], ["updated_at", "2018-12-10 14:33:20.399311"]]