app/controllers/halls_controller.rb

  def index
    @halls = Hall.all
---
SELECT "halls".* FROM "halls"

  def create
    @hall = Hall.new(hall_params)

    respond_to do |format|
      if @hall.save
---
INSERT INTO "halls" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Luetner"], ["created_at", "2018-12-10 14:41:40.516604"], ["updated_at", "2018-12-10 14:41:40.516604"]]

  def update
    respond_to do |format|
      if @hall.update(hall_params)
---
UPDATE "halls" SET "name" = ?, "updated_at" = ? WHERE "halls"."id" = ?  [["name", "Leutner"], ["updated_at", "2018-12-15 00:57:33.082477"], ["id", 1]]

    def set_hall
      @hall = Hall.find(params[:id])
---
SELECT  "halls".* FROM "halls" WHERE "halls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]