app/controllers/reviews_controller.rb

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("reviewer", "rating", "review", "food_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["reviewer", "me"], ["rating", 3], ["review", "good"], ["food_id", 1], ["created_at", "2018-12-10 15:13:56.362824"], ["updated_at", "2018-12-10 15:13:56.362824"]]
---
  def create
    @food = Food.find(params[:food_id])

    @review = @food.reviews.create(review_params)