app/controllers/statuses_controller.rb

  def create
    @amenity = Amenity.find(params[:amenity_id])

    @status = @amenity.statuses.create(statuses_params)
---
SELECT  "amenities".* FROM "amenities" WHERE "amenities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "statuses" ("reviewer", "status", "amenity_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["reviewer", "Ammar Abidi"], ["status", ""], ["amenity_id", 2], ["created_at", "2018-12-15 00:06:41.418585"], ["updated_at", "2018-12-15 00:06:41.418585"]]